[
  {
    "Id": "948591",
    "ThreadId": "404938",
    "Html": "\r\n<p>Firt of all, I wish to thank you for the MVVM Foundation. It is extremely helpful!</p>\r\n<p>I am fairly new to MVVM. I&nbsp;finally&nbsp;&quot;figured&quot; it out a few months ago, and I started with C# about a year and a half ago (all self&nbsp;thought), so&nbsp;please&nbsp;excuse any newbie&nbsp;mistakes in my coding (I do appreciate feedback on things\r\n I am doing wrong).&nbsp;</p>\r\n<p>In my recent project I needed an EditableObject which would also raise PropertyChanged when changes were discarded. For classes with only a few properties&nbsp;I would raise PropertyChanged manually when data was discarded. Eventually I had to handle classes\r\n with many properties. Being the problem solver I am, I went on a journey to figure out a way around manually writing all the property changed calls. What I came up with is EditableObject which inherits from ObervableObject (should probably call it EditableObservableObject),\r\n has all the Edit methods and automatically raises PropertyChanged on all the class properties that are decorated with ObservableProperty attribute.&nbsp;</p>\r\n<p>After posting this code on Stack Overflow I started thinking that there must be a better way to go about this. Is there something I have missed during my MVVM learning phase? I searched for a solution online, but I could not come across anything. I have\r\n a feeling that there may be a pre-existing elegant way about doing this.</p>\r\n<p>Currently the issue is that even the properties that were not changed will&nbsp;have&nbsp;their PropertyChanged event raised. I feel that this could cause a performance hit for large objects. This is the same reason I refrained from raising the change with\r\n an empty string, did not want&nbsp;unnecessary&nbsp;events being raised.&nbsp;</p>\r\n<p>To cut down on wall of text, I am&nbsp;going&nbsp;to link to the SO answer that I&nbsp;posted&nbsp;earlier using this class.</p>\r\n<p><a title=\"http://stackoverflow.com/a/13613586/1524162\" href=\"http://stackoverflow.com/a/13613586/1524162\">http://stackoverflow.com/a/13613586/1524162</a></p>\r\n<p>&nbsp;</p>\r\n<p>Thank you for any feedback,</p>\r\n<p>Aleks</p>\r\n",
    "PostedDate": "2012-11-28T12:56:55.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]